import React, { useState, useEffect } from 'react';
import donationQR from '../assets/images/donations.jpeg';

const DonateSection = () => {
  const [donations, setDonations] = useState([
    { id: 1, amount: '₹51,000', name: 'સ્વ. જયરામલાલ ભાણુભાઈ રાવલ ના પિતૃકુલના સંકલ્પ, કર્તા – રામજીભાઈ મહાલક્ષ્મી મુખી', place: 'સિદ્ધપુર / મુંબઈ' },
    { id: 2, amount: '₹51,000', name: 'સ્વ. પ્રભુદીન તથા સ્વ. પ્રભુપ્રસાદ નારાયણરામ રાવલ ના પિતૃકુલના સંકલ્પ, કર્તા – કાળુભાઈ પ્રભુપ્રસાદ રાવલ', place: 'સિદ્ધપુર' },
    { id: 3, amount: '₹50,000', name: 'સ્વ. કુંવરલાલ લાલજીરામ રાવલ તથા સ્વ. લક્ષ્મીબેન રાવલના પિતૃકુલના સંકલ્પ, કર્તા – ચંદ્ર સોમાભાઈ સિસોદિયા દેવ પરિવાર', place: 'સિદ્ધપુર' },
    { id: 4, amount: '₹35,001', name: 'સ્વ. પ્રભુદીન તથા સ્વ. હરસુખ માનિલાલ દેવ ના પિતૃકુલના સંકલ્પ, કર્તા – રમેશભાઈ તથા રવિન્દ્રભાઈ હરિભાઈ દેવ', place: 'વાવ / અમદાવાદ' },
    { id: 5, amount: '₹32,201', name: 'શ્રી હરસુખરામ મુખરામ દેવ, કર્તા – ગૌતમભાઈ હરસુખરામ દેવ', place: 'વડોદરા / રશિયા' },
  
    { id: 6, amount: '₹25,000', name: 'સ્વ. સુખીદાસ તથા ધનજીભાઈ હીરજીરામ રાવલ ના પિતૃકુલના સંકલ્પ, કર્તા – શ્રી દિલીપભાઈ અમરલાલ રાવલ', place: 'સિદ્ધપુર' },
    { id: 7, amount: '₹25,000', name: 'સ્વ. પ્રભુદીન તથા સરસ્વતી ગોરરામ રાવલ ના પિતૃકુલના સંકલ્પ, કર્તા – શ્રી ભાવકુમાર તથા યશવંતકુમાર રાવલ', place: 'દેપા / સિદ્ધપુર' },
    { id: 8, amount: '₹25,000', name: 'સ્વ. લાલજીભાઈ મોહનલાલ રાવલ ના પિતૃકુલના સંકલ્પ, કર્તા – નિકુંજભાઈ પ્રભુદાસ રાવલ', place: 'સિદ્ધપુર / અમદાવાદ' },
    { id: 9, amount: '₹25,000', name: 'સ્વ. અજીબેંન તથા કાંતિબેન તથા ધનકુમારી પિતૃકુલના સંકલ્પ, કર્તા – નીલેશભાઈ હરિભાઈ દેવ', place: 'વાવ / સિદ્ધપુર' },
    { id: 10, amount: '₹25,000', name: 'સ્વ. દશરથકુમાર દેવના પિતૃકુલના સંકલ્પ, કર્તા – ચંદ્ર સોમાભાઈ સિસોદિયા દેવ પરિવાર', place: 'વાવ / સિદ્ધપુર' },
  
    { id: 11, amount: '₹25,000', name: 'શ્રી મુખરામ આનંદ પુજાણાની તરફે, કર્તા – શ્રી કમલેશ કે.', place: 'યુએસએ / રશિયા' },
    { id: 12, amount: '₹25,000', name: 'સ્વ. સુખીદાસ કાળુ રાવલ ના પિતૃકુલના સંકલ્પ, કર્તા – શ્રી મોહન કાળુ રાવલ', place: 'વાપી / રશિયા' },
    { id: 13, amount: '₹25,000', name: 'સ્વ. લાલજીભાઈ ભાવલાલ સિંધી પિતૃકુલના સંકલ્પ, કર્તા – શ્રી અનિલ ભાવલાલ સિંધી', place: 'મહિડા રશિયા' },
    { id: 14, amount: '₹25,000', name: 'સ્વ. હીરસિંહ કુંવરરામ શ્રીરામ, કર્તા – શ્રી અજય બજરંગલાલ શ્રીરામ', place: 'વડોદરા / ઉદયપુર' },
  
    { id: 15, amount: '₹11,111', name: 'રીટાબેન હરસુખ દેવ', place: 'વાવ / અમદાવાદ' },
    { id: 16, amount: '₹11,111', name: 'સ્વ. અમરીબેન જગદીશલાલ રાવલ તથા મધુબેન મણિલાલ રાવલ ના સ્મરણાર્થે, કર્તા – સોલંકી પરિવાર', place: 'પાટણ' },
    { id: 17, amount: '₹11,111', name: 'સ્વ. સુખીદાસ તથા કેશવદાસ હરસુખરામ રાવલના પિતૃકુલના સંકલ્પ, કર્તા – શ્રી જનાર્દન લાલ તથા જ્ઞાનેશ હરસુખરામ રાવલ', place: 'સિદ્ધપુર' },
    { id: 18, amount: '₹11,111', name: 'સ્વ. દીકરાભાઈ પોપટલાલ તથા સ્વ. અણુબેન પોપટલાલ રાવલના પિતૃકુલના સંકલ્પ, કર્તા – ચંદ્ર ઉષાબેન નિશાળાભાઈ રાવલ', place: 'દેપા / અમદાવાદ' },
    { id: 19, amount: '₹11,111', name: 'સ્વ. સુખરામજી કાલિદાસ રાવલના પિતૃકુલના સંકલ્પ, કર્તા – શ્રી દીલિપકુમાર કાલિદાસ રાવલ', place: 'પાટણ / ડબલડ' },
  
    { id: 20, amount: '₹11,111', name: 'સ્વ. મધુબેન તથા રમણભાઈ રાવલના પિતૃકુલના સંકલ્પ, કર્તા – શ્રી મહેન્દ્રકુમાર અમરલાલ રાવલ', place: 'સાંદર / પાલનપુર' },
    { id: 21, amount: '₹11,111', name: 'ડૉ. રજનીકુમાર રાવલ', place: 'મોડાસા / અમદાવાદ' },
    { id: 22, amount: '₹11,111', name: 'શ્રી અશોકકુમાર વિજયરામ રાવલ (જુનાગઢ)', place: 'પાટણ / સિદ્ધપુર' },
    { id: 23, amount: '₹11,111', name: 'શ્રી મહેશકુમાર મહિબેન દેવ, કર્તા – નીલાબેન તથા રાજુભાઈ મહિબેન દેવ', place: 'વાવ / સિદ્ધપુર' },
    { id: 24, amount: '₹11,111', name: 'સ્વ. સુખરામજી આડસરસ રાવલ, કર્તા – ગોપાલભાઈ આડસરસ રાવલ', place: 'સિદ્ધપુર' },
  
    { id: 25, amount: '₹11,111', name: 'સ્વ. કાળુદાસ તથા કેશવદાસ મુખરામ રાવલના પિતૃકુલના સંકલ્પ, કર્તા – લાલજીભાઈ મુખરામ રાવલ', place: 'વડનગર / સુરત' },
    { id: 26, amount: '₹11,111', name: 'સ્વ. લક્ષ્મીબેન જગદીશલાલ કાલિદાસ રાવલના પિતૃકુલના સંકલ્પ, કર્તા – જગદીશભાઈ કાલિદાસ રાવલ', place: 'સિદ્ધપુર / વડોદરા' },
    { id: 27, amount: '₹11,111', name: 'શ્રી ભરતલાલ અશોક પંડ્યા, કર્તા – રૂપા તથા નિરંજન ભરતલાલ પંડ્યા', place: 'વાવ / કાલર' },
    { id: 28, amount: '₹11,111', name: 'સ્વ. સુખરામજી તથા જમનાબાઈ કુમાર પંડ્યા ના પિતૃકુલના સંકલ્પ, કર્તા – દિલીપકુમાર જમનાબાઈ પંડ્યા', place: 'સિદ્ધપુર / અમદાવાદ' },
    { id: 29, amount: '₹11,111', name: 'સ્વ. મંગળદાસ કેશવદાસ ડાકર ના પિતૃકુલના સંકલ્પ, કર્તા – શ્રી અશોકભાઈ કેશવદાસ ડાકર', place: 'સિદ્ધપુર' },
  
    { id: 30, amount: '₹11,111', name: 'રમ ભરતજી', place: 'કાલિકટ / રશિયા' },
  
    { id: 31, amount: '₹5,100', name: 'સ્વ. વસંતલાલ સુખલાલ રાવલ, કર્તા – શ્રી જમનાબાઈ સુખલાલ રાવલ', place: 'દેપા' },
    { id: 32, amount: '₹5,100', name: 'સ્વ. શાંતાબેન ચંદ્રલાલ રાવલ, કર્તા – શ્રી ગોપાલભાઈ ચંદ્રલાલ રાવલ', place: 'સિદ્ધપુર' },
    { id: 33, amount: '₹5,100', name: 'શ્રી હીરાલાલ દશરથ દેવ', place: 'વાવ / સિદ્ધપુર' },
    { id: 34, amount: '₹5,100', name: 'રજનીકુમાર પુરૂષોત્તમ રાવલ', place: 'સિદ્ધપુર / વાપી' },
    { id: 35, amount: '₹5,001', name: 'સ્વ. અબુબકર કાલિદાસ રાવલ, કર્તા – શ્રી સંધીપ અબુબકર રાવલ', place: 'પાટણ / સિદ્ધપુર' },
  
    { id: 36, amount: '₹5,001', name: 'ડૉ. વિનોદભાઈ નિખિલકુમાર રાવલ', place: 'વડનગર / વડોદરા' },
    { id: 37, amount: '₹5,001', name: 'સ્વ. શાંતાબેન નંદલાલ રાવલ, કર્તા – શ્રી ધર્મરાજ નંદલાલ રાવલ', place: 'મુંબઈ / સિદ્ધપુર' },
    { id: 38, amount: '₹5,001', name: 'રમ ભરતજી', place: 'વાવ' },
    { id: 39, amount: '₹5,001', name: 'શ્રી ભોગીલાલ વાડીલાલ દેવ', place: 'વાવ / સિદ્ધપુર' },
    { id: 40, amount: '₹5,001', name: 'ધર્મા મીરા વિનાયક સાદી', place: 'મુંબઈ' },
  
    { id: 41, amount: '₹5,001', name: 'ચંદ્ર વિપુલભાઈ મહાદેવ રાવલ', place: 'પાટણ / મહેસાણા' },
    { id: 42, amount: '₹5,001', name: 'સ્વ. અશોકભાઈ દેવ તથા શ્રીમતી અનિલબેન રાવલના પિતૃકુલના સંકલ્પ, કર્તા – શ્રી મહેશભાઈ દિપકકુમાર રાવલ', place: 'વડનગર / અમદાવાદ' },
    { id: 43, amount: '₹5,001', name: 'એન. આર. ગીરેન્દ્ર બાલચંદ્ર રાવલ', place: 'વાવ / સિદ્ધપુર' },
    { id: 44, amount: '₹5,001', name: 'શ્રી કાન્હાલાલ મુખરામ દેવ', place: 'વાવ / સિદ્ધપુર' },
    { id: 45, amount: '₹5,001', name: 'સ્વ. કાલિદાસ તથા કેશવદાસ જિનકર રાવલના પિતૃકુલના સંકલ્પ, કર્તા – શ્રી જયદેવભાઈ કેશવદાસ રાવલ', place: 'મોડાસા / સિદ્ધપુર' },
  
    { id: 46, amount: '₹2,501', name: 'ચંદ્ર દીપકભાઈ મહાદેવ રાવલ', place: 'બાલીસા / પાટણ' },
  
    { id: 47, amount: '₹2,100', name: 'સ્વ. સુખરામજી ભગવાનલાલ દેવ, કર્તા – હિમાંશુભાઈ ભગવાનલાલ દેવ', place: 'વાવ / સિદ્ધપુર' },
    { id: 48, amount: '₹1,100', name: 'સ્વ. રાજેશકુમાર પ્રવિણભાઈ રાવલ, કર્તા – મહેન્દ્ર તથા સરોજબેન રાવલ', place: 'સિદ્ધપુર / પાલનપુર' },
    { id: 49, amount: '₹1,100', name: 'ધની બળવંતરામ રાવલ', place: 'વાવ / અમદાવાદ' },
    { id: 50, amount: '₹1,100', name: 'ભવ્યક પર્વેશકુમાર રાવલ', place: 'દેપા / સિદ્ધપુર' },
    { id: 51, amount: '₹1,100', name: 'જૈનિષ પ્રવીણકુમાર રાવલ', place: 'દેપા / સિદ્ધપુર' },
    { id: 52, amount: '₹1,100', name: '૧૦ દિવસ નિરંતર સેવા – સ્વ. પ્રભુદાસ ગોપાલદાસ રાવલ ના પિતૃકુલના સંકલ્પ, કર્તા – હાર્દિકભાઈ તથા મીતલબેન પ્રભુદાસ રાવલ', place: 'દેપા / અમદાવાદ' }
  ]);
  
  

  return (
    <section className="donate-section">
      <div className="container">
        <div className="header-section">
          <span className="header-label">SUPPORT US</span>
          <h2 className="header-title">
            <strong><span>YOUR</span> CONTRIBUTION <span>MAKES A</span> DIFFERENCE</strong>
          </h2>
        </div>

        <div className="donate-content">
          <div className="donate-left">
            <div className="donations-table-wrapper">
              <table className="donations-table">
                <thead>
                  <tr>
                    <th>ક્રમ</th>
                    <th>દાનની રકમ</th>
                    <th>દાતાનું નામ</th >
                    <th>વતન/રહેઠાણ</th>
                  </tr>
                </thead>
                <tbody>
                  {donations.length > 0 ? (
                    donations.map((donation, index) => (
                      <tr key={donation.id}>
                        {/* ક્રમ */}
                        <td>{index + 1}</td>
                        {/* દાનની રકમ */}
                        <td>{donation.amount}</td>
                        {/* દાતાનું નામ */}
                        <td>{donation.name}</td>
                        {/* વતન/રહેઠાણ */}
                        <td>{donation.place}</td>
                      </tr>
                    ))
                  ) : (
                    <tr>
                      <td colSpan={4}>Donation data will be updated soon.</td>
                    </tr>
                  )}
                </tbody>
              </table>
            </div>
          </div>

          <div className="donate-right">
            <div className="qr-section">
              <h3>HDFC BANK</h3>
              <p className="qr-subtitle">QR Code for direct donations transfer</p>
              <div className="qr-image">
                <img src={donationQR} alt="HDFC Bank QR Code" />
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
};

export default DonateSection;
