import React, { useState, useEffect } from 'react';
import donationQR from '../assets/images/donations.jpeg';
import '../css/donate-responsive.css';

const DonateSection = () => {
  const [donations, setDonations] = useState([
    { id: 1, amount: '51,000 રૂ', name: 'સ્વ. અરુણાબેન ભાનુકાન્ત રાવલ ના પિતૃકલ્યાણ સંકલ્પે, હસ્તે- રેખાબેન મહર્ષિભાઈ મુનશી', place: 'સિદ્ધપુર / મુંબઈ' },
    { id: 2, amount: '51,000 રૂ', name: 'સ્વ. ભગવતીબેન તથા સ્વ. ભાનુપ્રસાદ નારાયણદાસ રાવલ ના પિતૃકલ્યાણ સંકલ્પે હસ્તે - કલ્પેશકુમાર ભાનુપ્રસાદ રાવલ', place: 'સિદ્ધપુર' },
    { id: 3, amount: '50,000 રૂ', name: 'સ્વ. ઈન્દુમતીબેન લાભશંકર રાવલ તથા સ્વ. લાભશંકર અંબાલાલ રાવલ ના પિતૃકલ્યાણ સંકલ્પે, હસ્તે- ગં.સ્વ. સવિતાબેન દિનેશચંદ્ર દવે પરિવાર', place: 'સિદ્ધપુર' },
    { id: 4, amount: '35,001 રૂ', name: 'સ્વ. કલાવતીબેન તથા સ્વ. હરિલાલ મણિલાલ દવે ના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - મનીષકુમાર તથા ગૌરવકુમાર હરિલાલ દવે', place: 'વાલમ / અમદાવાદ' },
    { id: 5, amount: '32,201 રૂ', name: 'શ્રી કિરીટકુમાર પ્રેમશંકર શુક્લ, હસ્તે - ગૌતમભાઈ કિરીટકુમાર શુક્લ', place: 'વડોદરા / રશિયા' },
    { id: 6, amount: '25,000 રૂ', name: 'સ્વ. સુમિત તથા દમયંતીબેન દિલીપકુમાર રાવલ ના પિતૃકલ્યાણ સંકલ્પે હસ્તે- શ્રી દિલીપભાઈ આનંદપ્રસાદ રાવલ', place: 'સિદ્ધપુર' },
    { id: 7, amount: '25,000 રૂ', name: 'સ્વ. કલાવતીબેન તથા દશરથલાલ ગીરધરલાલ રાવલ ના પિતૃકલ્યાણ સંકલ્પે હસ્તે - શ્રી પ્રવિણકુમાર તથા ચંદ્રેશભાઇ દશરથલાલ રાવલ', place: 'દેણપ / સિદ્ધપુર' },
    { id: 8, amount: '25,000 રૂ', name: 'સ્વ. પ્રમોદચંદ્ર નાનાલાલ રાવલ ના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - નિકુલભાઈ પ્રમોદચંદ્ર રાવલ', place: 'સિદ્ધપુર / અમદાવાદ' },
    { id: 9, amount: '25,000 રૂ', name: 'સ્વ. અર્પિત, સ્વ. ઇન્દુબેન તથા સ્વ. ઇન્દ્રવદનભાઈ પ્રવિણશંકર દવે ના પિતૃકલ્યાણ સંકલ્પે હસ્તે - દીપકભાઈ ઇન્દ્રવદનભાઈ દવે', place: 'વાલમ / સિદ્ધપુર' },
    { id: 10, amount: '25,000 રૂ', name: 'સ્વ. દિનેશચંદ્ર ઉમિયાશંકર દવેના પિતૃકલ્યાણ સંકલ્પે, હસ્તે- ગં.સ્વ. સવિતાબેન દિનેશચંદ્ર દવે પરિવાર', place: 'વાલમ / સિદ્ધપુર' },
    { id: 11, amount: '25,000 રૂ', name: 'શ્રી રામુલુ, આંદલ, પુરુષોત્તમન તથા ઇન્દ્ર, હસ્તે - શ્રી કમલાકન્નન કે.', place: 'ચેન્નાઈ / રશિયા' },
    { id: 12, amount: '25,000 રૂ', name: 'સ્વ. સુનિતા કુશલ રાણે ના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - શ્રી સંદીપ કુશલ રાણે', place: 'થાણે / રશિયા' },
    { id: 13, amount: '25,000 રૂ', name: 'સ્વ. મંદાબાઈ ભાગવત શિંદેના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - શ્રી અનિલ ભાગવત શિંદે', place: 'નાસિક / રશિયા' },
    { id: 14, amount: '25,000 રૂ', name: 'સ્વ. ઉર્મિલાદેવી ઠાકુરપ્રસાદ શ્રીવાસ્તવ, હસ્તે - શ્રી અવધેશ બજરંગબહાદુર શ્રીવાસ્તવ', place: 'વડોદરા / ઉત્તરપ્રદેશ' },
    { id: 15, amount: '11,111 રૂ', name: 'રીટાબેન હરિલાલ દવે', place: 'વાલમ / અમદાવાદ' },
    { id: 16, amount: '11,111 રૂ', name: 'સ્વ. રમાબેન જશવંતલાલ રાવલ તથા મધુસુદન મણીલાલ રાવલ ના સ્મરણાર્થે, હસ્તે સાંઈરામ પરિવાર', place: 'પાટણ' },
    { id: 17, amount: '11,111 રૂ', name: 'સ્વ. સુમિત્રાબેન તથા હરેશચંદ્ર હીરાલાલ રાવલના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - શ્રી જનકભાઈ તથા શ્રી જીતુભાઇ હરેશચંદ્ર રાવલ', place: 'સિદ્ધપુર' },
    { id: 18, amount: '11,111 રૂ', name: 'સ્વ. દિનેશભાઇ, પદ્માબેન તથા નાથાલાલ ગીરધરલાલ રાવલના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - ગં.સ્વ. ઉર્મિલાબેન દિનેશભાઇ રાવલ', place: 'દેણપ / અમદાવાદ' },
    { id: 19, amount: '11,111 રૂ', name: 'સ્વ. હસુમતીબેન કાંતિલાલ રાવલના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - શ્રી શૈલેષભાઇ કાંતિલાલ રાવલ', place: 'પાટણ / કપડવંજ' },
    { id: 20, amount: '11,111 રૂ', name: 'સ્વ. મણીબેન તથા સ્વ. ખેમચંદાસ રેવાશંકર રાવલના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - શ્રી મહેન્દ્રકુમાર ખેમચંદદાસ રાવલ', place: 'સંડેર / પાલનપુર' },
    { id: 21, amount: '11,111 રૂ', name: 'ડો. રુદ્ર જનકકુમાર રાવલ', place: 'મોટીદાઉ / અમદાવાદ' },
    { id: 22, amount: '11,111 રૂ', name: 'શ્રી જીતેન્દ્રકુમાર શિવપ્રસાદ રાવલ (જીનુભાઈ)', place: 'પાટણ / સિદ્ધપુર' },
    { id: 23, amount: '11,111 રૂ', name: 'શ્રી મહાશંકર મણિલાલ દવે, હસ્તે - બીનાબેન તથા રાજેશભાઈ મહાશંકર દવે', place: 'વાલમ / સિદ્ધપુર' },
    { id: 24, amount: '11,111 રૂ', name: 'સ્વ. કંચનબેન આનંદપ્રસાદ રાવલ, હસ્તે- રોહિતભાઈ આનંદપ્રસાદ રાવલ', place: 'સિદ્ધપુર' },
    { id: 25, amount: '11,111 રૂ', name: 'સ્વ. કાંતાબેન તથા કનૈયાલાલ મૂળશંકર રાવલના પિતૃકલ્યાણ સંકલ્પે હસ્તે: ભાવતોષભાઈ કે રાવલ', place: 'વડનગર / સુરત' },
    { id: 26, amount: '11,111 રૂ', name: 'સ્વ. સરલાબેન તથા જશવંતલાલ કાંતિલાલ રાવલના પિતૃકલ્યાણ સંકલ્પે હસ્તે: જીજ્ઞેશભાઈ જશવંતલાલ રાવલ', place: 'સિદ્ધપુર / વડોદરા' },
    { id: 27, amount: '11,111 રૂ', name: 'શ્રી ભદ્રેશભાઈ અમીધર પંડ્યા, હસ્તે- કૃપા તથા નિરવકુમાર ભદ્રેશભાઈ પંડ્યા', place: 'વાપી / કતાર' },
    { id: 28, amount: '11,111 રૂ', name: 'સ્વ. કૈલાસબેન તથા જીતેન્દ્રભાઈ રામશંકર પંડયા ના પિતૃકલ્યાણ સંકલ્પે હસ્તે - હિતેશકુમાર જીતેન્દ્રભાઈ પંડયા', place: 'સિદ્ધપુર / અમદાવાદ' },
    { id: 29, amount: '11,111 રૂ', name: 'સ્વ. ચંદુલાલ કાશીરામ ઠાકરના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - શ્રી અમરીશભાઈ પ્રવિણચંદ્ર ઠાકર', place: 'સિદ્ધપુર' },
    { id: 30, amount: '11,111 રૂ', name: 'રામ ભરોસે', place: 'કાલીકટ / રશિયા' },
    { id: 31, amount: '5,100 રૂ', name: 'સ્વ. વાસુદેવભાઇ રેવાશંકર રાવલ, હસ્તે - શ્રી જયંતીલાલ રેવાશંકર રાવલ', place: 'દેણપ' },
    { id: 32, amount: '5,100 રૂ', name: 'સ્વ. શારદાબેન ચંદુલાલ રાવલ, હસ્તે - શ્રી ગૌતમભાઈ ચંદુલાલ રાવલ', place: 'સિદ્ધપુર' },
    { id: 33, amount: '5,100 રૂ', name: 'શ્રી બિપીનભાઇ દેવશંકર દવે', place: 'વાલમ / સિદ્ધપુર' },
    { id: 34, amount: '5,100 રૂ', name: 'રાજુભાઈ પુંડરિકપ્રસાદ રાવલ', place: 'સિદ્ધપુર / સાણંદ' },
    { id: 35, amount: '5,001 રૂ', name: 'સ્વ. અતુલકુમાર કાંતિલાલ રાવલ , હસ્તે- શ્રી સંદીપ અતુલકુમાર રાવલ', place: 'પાટણ / સિદ્ધપુર' },
    { id: 36, amount: '5,001 રૂ', name: 'ડો. નિકીતાબેન નિકુંજકુમાર રાવલ', place: 'વડનગર / વલસાડ' },
    { id: 37, amount: '5,001 રૂ', name: 'સ્વ. શારદાબેન નવિંચંદ્ર રાવલ, હસ્તે- શ્રી ધનંજયભાઈ નવિંચંદ્ર રાવલ', place: 'મણુંદ / સિદ્ધપુર' },
    { id: 38, amount: '5,001 રૂ', name: 'રામ ભરોસે', place: 'વાલમ' },
    { id: 39, amount: '5,001 રૂ', name: 'શ્રી ભોગીલાલ વાડીલાલ દવે', place: 'વાલમ / સિદ્ધપુર' },
    { id: 40, amount: '5,001 રૂ', name: 'ધૈર્ય મીરા વિનોદકુમાર સોલંકી', place: 'મુંબઈ' },
    { id: 41, amount: '5,001 રૂ', name: 'ગં.સ્વ. નિમુબેન મફતલાલ રાવલ', place: 'પાટણ / મહેસાણા' },
    { id: 42, amount: '5,001 રૂ', name: 'સ્વ. અરુણબા તથા સ્વ. હીનાબેન અસિતભાઈ રાવલના પિતૃકલ્યાણ સંકલ્પે, હસ્તે : શ્રી મયંકભાઇ દિલીપકુમાર રાવલ', place: 'વડનગર / અબુધાબી' },
    { id: 43, amount: '5,001 રૂ', name: 'ગં. સ્વ. નીરુબેન બાબુલાલ રાવલ', place: 'વાલમ / સિદ્ધપુર' },
    { id: 44, amount: '5,001 રૂ', name: 'શ્રી કૌશિકભાઈ મનુપ્રસાદ દવે', place: 'વાલમ / સિદ્ધપુર' },
    { id: 45, amount: '5,001 રૂ', name: 'સ્વ. કોકિલાબેન તથા કનૈયાલાલ ગિરજાશંકર રાવલના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - શ્રી જયદેવભાઇ કનૈયાલાલ રાવલ', place: 'મણુંદ / સિદ્ધપુર' },
    { id: 46, amount: '2,501 રૂ', name: 'ગં.સ્વ. લલીતાબેન મણિલાલ રાવલ', place: 'બાલીસણા / પાટણ' },
    { id: 47, amount: '2,100 રૂ', name: 'સ્વ. પુષ્પાબેન ભગવતીપ્રસાદ દવે , હસ્તે - હિમાંશુભાઈ ભગવતીપ્રસાદ દવે', place: 'વાલમ / સિદ્ધપુર' },
    { id: 48, amount: '2,101 રૂ', name: 'સ્વ. શ્રી સુરેશચંદ્ર મૂળશંકર રાવલના પિત કલ્યાણ સંકલ્પે, હસ્તે રાકેશભાઈ રાવલ', place: 'વડનગર / ગાંધીનગર' },
    { id: 49, amount: '1,100 રૂ', name: 'સ્વ. રાજેશકુમાર પ્રવીણભાઈ રાવલ હસ્તે - મેઘનાબેન અને સરોજબેન રાવલ', place: 'સિદ્ધપુર / ખોલવાડા' },
    { id: 50, amount: '1,100 રૂ', name: 'ધાન્વી ધવલકુમાર રાવલ', place: 'વાલમ / અમદાવાદ' },
    { id: 51, amount: '1,100 રૂ', name: 'ભાર્ગવ પ્રવિણકુમાર રાવલ', place: 'દેણપ / સિદ્ધપુર' },
    { id: 52, amount: '1,100 રૂ', name: 'જૈમિન પ્રવિણકુમાર રાવલ', place: 'દેણપ / સિદ્ધપુર' },
    { id: 53, amount: '1,100 રૂ', name: 'વિપુલભાઈ દિનેશકુમાર રાવલ', place: 'સંડેર / પાલનપુર' },
    { id: 54, amount: '10 દિવસ – મિનરલ પાણી', name: 'સ્વ. પ્રફુલભાઇ ભોગીલાલ રાવલ ના પિતૃકલ્યાણ સંકલ્પે, હસ્તે - હાર્દિકભાઈ તથા માર્મિકભાઈ પ્રફુલભાઇ રાવલ', place: 'દેણપ / અમદાવાદ' }
  ]);



  return (
    <section className="donate-section">
      <div className="container">
        <div className="header-section">
          <span className="header-label">Support Us</span>
          <h2 className="header-title">
            <strong><span>Your</span> Contribution <span>Makes A</span> Difference</strong>
          </h2>
        </div>

        <div className="donate-content">
          <div className="donate-left">
            <div className="donations-table-wrapper">
              <table className="donations-table">
                <thead>
                  <tr>
                    <th>ક્રમ</th>
                    <th>દાનની રકમ</th>
                    <th>દાતાનું નામ</th >
                    <th>વતન/રહેઠાણ</th>
                  </tr>
                </thead>
                <tbody>
                  {donations.length > 0 ? (
                    donations.map((donation, index) => (
                      <tr key={donation.id}>
                        {/* ક્રમ */}
                        <td>{index + 1}</td>
                        {/* દાનની રકમ */}
                        <td>{donation.amount}</td>
                        {/* દાતાનું નામ */}
                        <td>{donation.name}</td>
                        {/* વતન/રહેઠાણ */}
                        <td>{donation.place}</td>
                      </tr>
                    ))
                  ) : (
                    <tr>
                      <td colSpan={4}>Donation data will be updated soon.</td>
                    </tr>
                  )}
                </tbody>
              </table>
            </div>
          </div>

          <div className="donate-right">
            <div className="qr-section">
              <h3>HDFC Bank</h3>
              <p className="qr-subtitle">QR Code for direct donations transfer</p>
              <div className="qr-image">
                <img src={donationQR} alt="HDFC Bank QR Code" />
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
};

export default DonateSection;
